# Custom model using YOLO configguration

nc: 1  
scales: 
  n: [0.33, 0.25, 512]  
  s: [0.50, 0.50, 512]  

backbone:
  - [-1, 1, Conv, [32, 3, 2]]        
  - [-1, 1, Conv, [64, 3, 2]]        
  - [-1, 1, Bottleneck, [64, 0.5]]   
  - [-1, 1, Conv, [128, 3, 2]]       
  - [-1, 2, C3, [128]]               
  - [-1, 1, Conv, [256, 3, 2]]       
  - [-1, 1, SPPF, [256, 5]]          

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  
  - [[-1, 4], 1, Concat, [1]]                  
  - [-1, 1, C3, [128]]                         

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]                  
  - [-1, 1, C3, [64]]                         

  - [[6, 8, 10], 1, Detect, [nc]]              
